v2206/Projects/validatioin_CHAD/scalar_noDiff/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       volVectorField;
    location    "45";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
62500
(
(-1.70859e-05 1.67983e-05 0)
(-6.52279e-05 1.9816e-05 0)
(-0.000105876 1.72159e-05 0)
(-0.000133157 1.46471e-05 0)
(-0.000150262 1.3381e-05 0)
(-0.000162697 1.31039e-05 0)
(-0.000174 1.32705e-05 0)
(-0.000185554 1.3534e-05 0)
...
)
;

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    fixedWalls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
