v2206/Projects/validatioin_CHAD/scalar_noDiff/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       volScalarField;
    location    "45";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
62500
(
9.27147e-09
1.2705e-08
1.44463e-08
1.4687e-08
1.3813e-08
1.24385e-08
1.09572e-08
9.49925e-09
...
)
;

boundaryField
{
    movingWall
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           uniform 0;
    }
    fixedWalls
    {
        type            nutkWallFunction;
        blending        stepwise;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
