v2206/Projects/validatioin_CHAD/scalar_noDiff/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=64;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          250;
        startFace       124500;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          750;
        startFace       124750;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          125000;
        startFace       125500;
    }
)

// ************************************************************************* //
